Repository: zBossPC/Anywhere
Catalog: Shared/Localizable.xcstrings
Source language: en
Languages: ar, es, fa, ru, tr, vi, zh_hans

source: Invalid chain — some proxies are missing
ar: سلسلة غير صالحة — بعض البروكسيات مفقودة
es: Cadena inválida — faltan algunos proxies
fa: زنجیره نامعتبر — برخی پروکسی‌ها وجود ندارند
ru: Недействительная цепочка — некоторые прокси отсутствуют
tr: Geçersiz zincir — bazı proxy'ler eksik
vi: Chuỗi không hợp lệ — thiếu một số proxy
zh_hans: 链式代理无效 — 某些代理缺失

source: Invalid Fingerprint
ar: بصمة غير صالحة
es: Huella digital no válida
fa: اثر انگشت نامعتبر
ru: Недействительный отпечаток
tr: Geçersiz Parmak İzi
vi: Vân tay không hợp lệ
zh_hans: 指纹无效

source: Invalid fingerprint. Must be a 64-character hex string, or it already exists.
ar: بصمة غير صالحة. يجب أن تكون سلسلة سداسية عشرية مكونة من 64 حرفًا، أو أنها موجودة بالفعل.
es: Huella digital no válida. Debe ser una cadena hexadecimal de 64 caracteres, o ya existe.
fa: اثر انگشت نامعتبر. باید یک رشته هگزادسیمال ۶۴ کاراکتری باشد، یا قبلاً وجود دارد.
ru: Недействительный отпечаток. Должна быть шестнадцатеричная строка из 64 символов, или он уже существует.
tr: Geçersiz parmak izi. 64 karakterlik bir onaltılık dize olmalı ya da zaten mevcut.
vi: Vân tay không hợp lệ. Phải là chuỗi hex 64 ký tự, hoặc đã tồn tại.
zh_hans: 指纹无效。必须是 64 个十六进制字符的字符串，或者已经存在。

source: Invalid subscription URL.
ar: رابط الاشتراك غير صالح.
es: URL de suscripción no válida.
fa: نشانی اشتراک نامعتبر است.
ru: Недействительный URL подписки.
tr: Geçersiz abonelik URL'si.
vi: URL đăng ký không hợp lệ.
zh_hans: 订阅链接无效。

source: Join Telegram Group
ar: انضم إلى مجموعة تيليجرام
es: Unirse al grupo de Telegram
fa: عضویت در گروه تلگرام
ru: Присоединиться к группе Telegram
tr: Telegram Grubuna Katıl
vi: Tham gia nhóm Telegram
zh_hans: 加入 Telegram 群组

source: Leave empty to automatically discover and upgrade to encrypted DNS servers.
ar: اتركه فارغًا لاكتشاف خوادم DNS المشفّرة والترقية إليها تلقائيًا.
es: Dejar vacío para descubrir y actualizar automáticamente a servidores DNS cifrados.
fa: برای کشف و ارتقاء خودکار به سرورهای DNS رمزنگاری‌شده، خالی بگذارید.
ru: Оставьте пустым для автоматического обнаружения и перехода на зашифрованные DNS-серверы.
tr: Şifreli DNS sunucularını otomatik olarak keşfetmek ve yükseltmek için boş bırakın.
vi: Để trống để tự động phát hiện và nâng cấp lên máy chủ DNS mã hóa.
zh_hans: 留空以自动发现并升级到加密 DNS 服务器。

source: Link
ar: رابط
es: Enlace
fa: لینک
ru: Ссылка
tr: Bağlantı
vi: Liên kết
zh_hans: 链接

source: Link Type
ar: نوع الرابط
es: Tipo de enlace
fa: نوع لینک
ru: Тип ссылки
tr: Bağlantı Türü
vi: Loại liên kết
zh_hans: 链接类型

source: Logs
ar: السجلات
es: Registros
fa: گزارش‌ها
ru: Журналы
tr: Günlükler
vi: Nhật ký
zh_hans: 日志

source: Manual
ar: يدوي
fa: دستی
ru: Вручную
tr: Manuel
vi: Thủ công
zh_hans: 手动

source: Method
ar: الطريقة
es: Método
fa: روش
ru: Метод
tr: Yöntem
vi: Phương thức
zh_hans: 加密方式

source: Mode
ar: الوضع
es: Modo
fa: حالت
ru: Режим
tr: Mod
vi: Chế độ
zh_hans: 模式

source: More
ar: المزيد
es: Más
fa: بیشتر
ru: Ещё
tr: Daha Fazla
vi: Thêm
zh_hans: 更多

source: Move Down
ar: نقل لأسفل
es: Mover hacia abajo
fa: انتقال به پایین
ru: Переместить вниз
tr: Aşağı Taşı
vi: Di chuyển xuống
zh_hans: 向下移动

source: Move Up
ar: نقل لأعلى
es: Mover hacia arriba
fa: انتقال به بالا
ru: Переместить вверх
tr: Yukarı Taşı
vi: Di chuyển lên
zh_hans: 向上移动

source: Name
ar: الاسم
es: Nombre
fa: نام
ru: Имя
tr: Ad
vi: Tên
zh_hans: 名称

source: Network
ar: الشبكة
es: Red
fa: شبکه
ru: Сеть
tr: Ağ
vi: Mạng
zh_hans: 网络

source: Network error: %@
ar: خطأ في الشبكة: %@
es: Error de red: %@
fa: خطای شبکه: %@
ru: Ошибка сети: %@
tr: Ağ hatası: %@
vi: Lỗi mạng: %@
zh_hans: 网络错误：%@

source: New Chain
ar: سلسلة جديدة
es: Nueva cadena
fa: زنجیره جدید
ru: Новая цепочка
tr: Yeni Zincir
vi: Chuỗi mới
zh_hans: 新建链式代理

source: Next
ar: التالي
es: Siguiente
fa: بعدی
ru: Далее
tr: İleri
vi: Tiếp theo
zh_hans: 下一步

source: No Certificate
ar: لا توجد شهادة
es: Sin certificado
fa: بدون گواهی
ru: Нет сертификата
tr: Sertifika Yok
vi: Không có chứng chỉ
zh_hans: 无证书

source: No Chains
ar: لا توجد سلاسل
es: Sin cadenas
fa: بدون زنجیره
ru: Нет цепочек
tr: Zincir Yok
vi: Không có chuỗi
zh_hans: 没有链式代理

source: No Proxies
ar: لا توجد بروكسيات
es: Sin proxies
fa: بدون پروکسی
ru: Нет прокси
tr: Proxy Yok
vi: Không có proxy
zh_hans: 没有代理

source: No Recent Logs
ar: لا توجد سجلات حديثة
es: Sin registros recientes
fa: گزارش اخیری وجود ندارد
ru: Нет недавних журналов
tr: Son Günlükler Yok
vi: Không có nhật ký gần đây
zh_hans: 无最近日志

source: No Recent Requests
ar: لا توجد طلبات حديثة
es: Sin solicitudes recientes
fa: درخواست اخیری وجود ندارد
ru: Нет недавних запросов
tr: Son İstekler Yok
vi: Không có yêu cầu gần đây
zh_hans: 无最近请求

source: No trusted certificates
ar: لا توجد شهادات موثوقة
es: No hay certificados de confianza
fa: گواهی مورد اعتمادی وجود ندارد
ru: Нет доверенных сертификатов
tr: Güvenilir sertifika yok
vi: Không có chứng chỉ tin cậy
zh_hans: 没有受信任的证书

source: No valid configurations found in subscription.
ar: لم يتم العثور على إعدادات صالحة في الاشتراك.
es: No se encontraron configuraciones válidas en la suscripción.
fa: هیچ پیکربندی معتبری در اشتراک یافت نشد.
ru: В подписке не найдено допустимых конфигураций.
tr: Abonelikte geçerli yapılandırma bulunamadı.
vi: Không tìm thấy cấu hình hợp lệ trong đăng ký.
zh_hans: 订阅中未找到有效的配置。

source: None
ar: لا شيء
es: Ninguno
fa: هیچ
ru: Нет
tr: Yok
vi: Không
zh_hans: 无

source: Not Configured
ar: غير مُهيّأ
es: No configurado
fa: پیکربندی نشده
ru: Не настроено
tr: Yapılandırılmadı
vi: Chưa cấu hình
zh_hans: 未配置

source: Not Enough Proxies
ar: عدد البروكسيات غير كافٍ
es: No hay suficientes proxies
fa: تعداد پروکسی‌ها کافی نیست
ru: Недостаточно прокси
tr: Yeterli Proxy Yok
vi: Không đủ proxy
zh_hans: 代理数量不足

source: Not recommended.
ar: غير مستحسن.
es: No recomendado.
fa: توصیه نمی‌شود.
ru: Не рекомендуется.
tr: Önerilmez.
vi: Không khuyến nghị.
zh_hans: 不推荐。

source: Not Trusted
ar: غير موثوق
es: No de confianza
fa: مورد اعتماد نیست
ru: Не доверен
tr: Güvenilmiyor
vi: Không tin cậy
zh_hans: 未信任

source: Off
ar: إيقاف
es: Desactivado
fa: خاموش
ru: Выкл.
tr: Kapalı
vi: Tắt
zh_hans: 关闭

source: OK
ar: موافق
es: Aceptar
fa: تأیید
ru: ОК
tr: Tamam
zh_hans: 好

source: On
ar: تشغيل
es: Activado
fa: روشن
ru: Вкл.
tr: Açık
vi: Bật
zh_hans: 开启

source: Open Source Libraries
ar: مكتبات مفتوحة المصدر
es: Bibliotecas de código abierto
fa: کتابخانه‌های متن‌باز
ru: Библиотеки с открытым кодом
tr: Açık Kaynak Kütüphaneleri
vi: Thư viện mã nguồn mở
zh_hans: 开源库

source: Operation
ar: العملية
es: Operación
fa: عملیات
ru: Операция
tr: İşlem
vi: Thao tác
zh_hans: 操作

source: Other
ar: أخرى
es: Otros
fa: سایر
ru: Другое
tr: Diğer
vi: Khác
zh_hans: 其他

source: Packets sent to a reflection address are returned to their sender instead of being routed or proxied.
ar: تُعاد الحِزَم المُرسَلة إلى عنوان انعكاس إلى مُرسِلها بدلاً من توجيهها أو تمريرها عبر الوكيل.
es: Los paquetes enviados a una dirección de reflexión se devuelven al remitente en lugar de enrutarse o pasar por el proxy.
fa: بسته‌های ارسال‌شده به یک آدرس بازتاب، به‌جای مسیریابی یا عبور از پراکسی، به فرستنده‌شان بازگردانده می‌شوند.
ru: Пакеты, отправленные на адрес отражения, возвращаются отправителю вместо маршрутизации или проксирования.
tr: Bir yansıma adresine gönderilen paketler yönlendirilmek veya proxy üzerinden geçirilmek yerine gönderenine geri döndürülür.
vi: Các gói tin được gửi đến địa chỉ phản chiếu sẽ được trả lại cho người gửi thay vì được định tuyến hoặc đi qua proxy.
zh_hans: 发送到反射地址的数据包会被退回给发送方，而不会进行路由或代理。

source: Password
ar: كلمة المرور
es: Contraseña
fa: رمز عبور
ru: Пароль
tr: Parola
vi: Mật khẩu
zh_hans: 密码

source: Path
ar: المسار
es: Ruta
fa: مسیر
ru: Путь
tr: Yol
vi: Đường dẫn
zh_hans: 路径

source: Permission denied
ar: تم رفض الإذن
es: Permiso denegado
fa: اجازه رد شد
ru: Нет разрешения
tr: İzin reddedildi
vi: Quyền bị từ chối
zh_hans: 权限被拒绝

source: Phase
ar: المرحلة
es: Fase
fa: مرحله
ru: Фаза
tr: Aşama
vi: Giai đoạn
zh_hans: 阶段

source: Port
ar: المنفذ
es: Puerto
fa: پورت
ru: Порт
tr: Bağlantı Noktası
vi: Cổng
zh_hans: 端口

source: Protocol
ar: البروتوكول
es: Protocolo
fa: پروتکل
ru: Протокол
tr: Protokol
vi: Giao thức
zh_hans: 协议

source: Proxies
ar: البروكسيات
fa: پروکسی‌ها
ru: Прокси
tr: Proxy'ler
vi: Proxy
zh_hans: 代理

source: Proxy
ar: بروكسي
fa: پروکسی
ru: Прокси
zh_hans: 代理

source: Proxy Mode
ar: وضع الوكيل
es: Modo proxy
fa: حالت پروکسی
ru: Режим прокси
tr: Proxy Modu
vi: Chế độ proxy
zh_hans: 代理模式

source: Public Key
ar: المفتاح العام
es: Clave pública
fa: کلید عمومی
ru: Публичный ключ
tr: Açık Anahtar
vi: Khóa công khai
zh_hans: 公钥

source: QR Code
ar: رمز QR
es: Código QR
fa: کد QR
ru: QR-код
tr: QR Kodu
vi: Mã QR
zh_hans: 二维码

source: Reconnecting...
ar: جارٍ إعادة الاتصال...
es: Reconectando...
fa: در حال اتصال مجدد...
ru: Переподключение...
tr: Yeniden Bağlanıyor...
vi: Đang kết nối lại...
zh_hans: 正在重连...

source: Reflection
ar: الانعكاس
es: Reflexión
fa: بازتاب
ru: Отражение
tr: Yansıma
vi: Phản chiếu
zh_hans: 反射

source: Reflection Addresses
ar: عناوين الانعكاس
es: Direcciones de reflexión
fa: آدرس‌های بازتاب
ru: Адреса отражения
tr: Yansıma Adresleri
vi: Địa chỉ phản chiếu
zh_hans: 反射地址

source: Regenerate
ar: إعادة الإنشاء
es: Regenerar
fa: تولید مجدد
ru: Создать заново
tr: Yeniden Oluştur
vi: Tạo lại
zh_hans: 重新生成

source: Regenerate Certificate
ar: إعادة إنشاء الشهادة
es: Regenerar certificado
fa: تولید مجدد گواهی
ru: Создать сертификат заново
tr: Sertifikayı Yeniden Oluştur
vi: Tạo lại chứng chỉ
zh_hans: 重新生成证书

source: REJECT
ar: رفض
es: Rechazar
fa: مسدود
ru: Отклонить
tr: Reddet
vi: Từ chối
zh_hans: 拒绝

source: Reject Data
ar: رفض البيانات
es: Rechazar datos
fa: رد داده
ru: Отклонить данные
tr: Veriyi Reddet
vi: Từ chối dữ liệu
zh_hans: 拒绝 数据

source: Reject GIF
ar: رفض GIF
es: Rechazar GIF
fa: رد GIF
ru: Отклонить GIF
tr: GIF'i Reddet
vi: Từ chối GIF
zh_hans: 拒绝 GIF

source: Reject Text
ar: رفض نص
es: Rechazar texto
fa: رد متن
ru: Отклонить текст
tr: Metni Reddet
vi: Từ chối văn bản
zh_hans: 拒绝 文本

source: Remove
ar: إزالة
es: Eliminar
fa: حذف
ru: Удалить
tr: Kaldır
vi: Xóa
zh_hans: 移除

source: Rename
ar: إعادة تسمية
es: Renombrar
fa: تغییر نام
ru: Переименовать
tr: Yeniden Adlandır
vi: Đổi tên
zh_hans: 重新命名

source: Rename Rule Set
ar: إعادة تسمية مجموعة القواعد
es: Renombrar conjunto de reglas
fa: تغییر نام مجموعه قانون
ru: Переименовать набор правил
tr: Kural Setini Yeniden Adlandır
vi: Đổi tên bộ quy tắc
zh_hans: 重新命名代理集

source: Reorder Proxies
ar: إعادة ترتيب البروكسيات
es: Reordenar proxies
fa: مرتب‌سازی مجدد پروکسی‌ها
ru: Изменить порядок прокси
tr: Proxy'leri Yeniden Sırala
vi: Sắp xếp lại Proxy
zh_hans: 重新排序代理

source: Replacement
ar: الاستبدال
es: Reemplazo
fa: جایگزینی
ru: Замена
tr: Değiştirme
vi: Thay thế
zh_hans: 替换

source: Request
ar: طلب
es: Solicitud
fa: درخواست
ru: Запрос
tr: İstek
vi: Yêu cầu
zh_hans: 请求

source: Requests
ar: الطلبات
es: Solicitudes
fa: درخواست‌ها
ru: Запросы
tr: İstekler
vi: Yêu cầu
zh_hans: 请求

source: Reset
ar: إعادة تعيين
es: Restablecer
fa: بازنشانی
ru: Сбросить
tr: Sıfırla
vi: Đặt lại
zh_hans: 重置

source: Response
ar: استجابة
es: Respuesta
fa: پاسخ
ru: Ответ
tr: Yanıt
vi: Phản hồi
zh_hans: 响应

source: Rewrite
ar: إعادة كتابة
es: Reescritura
fa: بازنویسی
ru: Перезапись
tr: Yeniden Yazma
vi: Viết lại
zh_hans: 重写

source: Root Certificate
ar: الشهادة الجذرية
es: Certificado raíz
fa: گواهی ریشه
ru: Корневой сертификат
tr: Kök Sertifika
vi: Chứng chỉ gốc
zh_hans: 根证书

source: Route Preview
ar: معاينة المسار
es: Vista previa de la ruta
fa: پیش‌نمایش مسیر
ru: Предпросмотр маршрута
tr: Rota Önizlemesi
vi: Xem trước tuyến
zh_hans: 路由预览

source: Route To
ar: التوجيه إلى
es: Dirigir a
fa: مسیریابی به
ru: Направить к
tr: Yönlendir
vi: Chuyển đến
zh_hans: 路由到

source: Route traffic to your home country directly, bypassing the proxy for faster local access.
ar: وجّه حركة المرور إلى بلدك مباشرة، متجاوزًا البروكسي للوصول المحلي الأسرع.
es: Dirige el tráfico a tu país directamente, evitando el proxy para un acceso local más rápido.
fa: ترافیک به کشور خود را مستقیماً هدایت کنید و پروکسی را برای دسترسی سریع‌تر دور بزنید.
ru: Направляйте трафик в вашу страну напрямую, минуя прокси для более быстрого локального доступа.
tr: Yerel erişimi hızlandırmak için trafiği proxy'yi atlayarak doğrudan kendi ülkenize yönlendirin.
vi: Định tuyến lưu lượng đến quốc gia của bạn trực tiếp, bỏ qua proxy để truy cập nội địa nhanh hơn.
zh_hans: 将访问本国的流量直连，绕过代理以获得更快的本地访问速度。

source: Routing
ar: التوجيه
es: Enrutamiento
fa: مسیریابی
ru: Маршрутизация
tr: Yönlendirme
vi: Định tuyến
zh_hans: 路由

source: Routing Rules
ar: قواعد التوجيه
es: Reglas de enrutamiento
fa: قوانین مسیریابی
ru: Правила маршрутизации
tr: Yönlendirme Kuralları
vi: Quy tắc định tuyến
zh_hans: 路由规则

source: Routing Rules Updated
ar: تم تحديث قواعد التوجيه
es: Reglas de enrutamiento actualizadas
fa: قوانین مسیریابی به‌روزرسانی شد
ru: Правила маршрутизации обновлены
tr: Yönlendirme Kuralları Güncellendi
vi: Đã cập nhật quy tắc định tuyến
zh_hans: 路由规则已更新

source: Rule
ar: قاعدة
es: Regla
fa: قاعده
ru: Правило
tr: Kural
vi: Quy tắc
zh_hans: 规则

source: Rule Set
ar: مجموعة قواعد
es: Conjunto de reglas
fa: مجموعه قانون
ru: Набор правил
tr: Kural Seti
vi: Bộ quy tắc
zh_hans: 规则集

source: Rule set is too large.
ar: مجموعة القواعد كبيرة جدًا.
es: El conjunto de reglas es demasiado grande.
fa: مجموعه قانون خیلی بزرگ است.
ru: Набор правил слишком велик.
tr: Kural seti çok büyük.
vi: Bộ quy tắc quá lớn.
zh_hans: 规则集过大。

source: Rule set was removed.
ar: تمت إزالة مجموعة القواعد.
es: Se eliminó el conjunto de reglas.
fa: مجموعه قانون حذف شد.
ru: Набор правил удалён.
tr: Kural seti kaldırıldı.
vi: Đã xóa bộ quy tắc.
zh_hans: 规则集已被移除。

source: Rule Sets
ar: مجموعات القواعد
es: Conjuntos de reglas
fa: مجموعه‌های قانون
ru: Наборы правил
tr: Kural Setleri
vi: Các bộ quy tắc
zh_hans: 规则集

source: Rules
ar: القواعد
es: Reglas
fa: قوانین
ru: Правила
tr: Kurallar
vi: Quy tắc
zh_hans: 规则

source: Save
ar: حفظ
es: Guardar
fa: ذخیره
ru: Сохранить
tr: Kaydet
vi: Lưu
zh_hans: 保存

source: Scan your QR code
ar: امسح رمز QR الخاص بك
es: Escanea tu código QR
fa: کد QR خود را اسکن کنید
ru: Отсканируйте QR-код
tr: QR kodunuzu tarayın
vi: Quét mã QR của bạn
zh_hans: 扫描二维码

source: Script
ar: نص برمجي
fa: اسکریپت
ru: Скрипт
tr: Komut Dosyası
vi: Tập lệnh
zh_hans: 脚本

source: Search
ar: بحث
es: Búsqueda
fa: جستجو
ru: Поиск
tr: Arama
vi: Tìm kiếm
zh_hans: 搜索

source: Search is not a valid regular expression.
ar: البحث ليس تعبيرًا منتظمًا صالحًا.
es: La búsqueda no es una expresión regular válida.
fa: جستجو یک عبارت منظم معتبر نیست.
ru: Поиск не является допустимым регулярным выражением.
tr: Arama geçerli bir düzenli ifade değildir.
vi: Tìm kiếm không phải là biểu thức chính quy hợp lệ.
zh_hans: 搜索不是一个有效的正则表达式。

source: Search is required.
ar: البحث مطلوب.
es: Se requiere la búsqueda.
fa: جستجو الزامی است.
ru: Требуется поиск.
tr: Arama gereklidir.
vi: Tìm kiếm là bắt buộc.
zh_hans: 必须指定搜索内容。

source: Security
ar: الأمان
es: Seguridad
fa: امنیت
ru: Безопасность
tr: Güvenlik
vi: Bảo mật
zh_hans: 安全

source: Select
ar: اختيار
es: Seleccionar
fa: انتخاب
ru: Выбрать
tr: Seç
vi: Chọn
zh_hans: 选择

source: Select Proxy
ar: اختر بروكسي
es: Seleccionar proxy
fa: انتخاب پروکسی
ru: Выбрать прокси
tr: Proxy Seç
vi: Chọn proxy
zh_hans: 选择代理

source: Server
ar: الخادم
es: Servidor
fa: سرور
ru: Сервер
tr: Sunucu
vi: Máy chủ
zh_hans: 服务器

source: Settings
ar: الإعدادات
es: Ajustes
fa: تنظیمات
ru: Настройки
tr: Ayarlar
vi: Cài đặt
zh_hans: 设置

source: SHA-256 Fingerprint
ar: بصمة SHA-256
es: Huella SHA-256
fa: اثر انگشت SHA-256
ru: Отпечаток SHA-256
tr: SHA-256 Parmak İzi
vi: Dấu vân tay SHA-256
zh_hans: SHA-256 指纹

source: Stream Script
ar: نص برمجي للتدفق
es: Script de Flujo
fa: اسکریپت جریانی
ru: Потоковый скрипт
tr: Akış Komut Dosyası
vi: Tập lệnh luồng
zh_hans: 流式脚本

source: Subscribe
ar: اشتراك
es: Suscribirse
fa: اشتراک
ru: Подписаться
tr: Abone Ol
vi: Đăng ký
zh_hans: 订阅

source: Subscribe Rule Set
ar: الاشتراك في مجموعة القواعد
es: Suscribirse al conjunto de reglas
fa: اشتراک در مجموعه قانون
ru: Подписаться на набор правил
tr: Kural Setine Abone Ol
vi: Đăng ký bộ quy tắc
zh_hans: 订阅规则集

source: Subscription
ar: اشتراك
es: Suscripción
fa: اشتراک
ru: Подписка
tr: Abonelik
vi: Đăng ký
zh_hans: 订阅

source: Subscription Failed
ar: فشل الاشتراك
es: Error de suscripción
fa: اشتراک ناموفق بود
ru: Ошибка подписки
tr: Abonelik Başarısız
vi: Đăng ký thất bại
zh_hans: 订阅失败

source: Subscriptions
ar: الاشتراكات
es: Suscripciones
fa: اشتراک‌ها
ru: Подписки
tr: Abonelikler
vi: Đăng ký
zh_hans: 订阅

source: Supports proxy, subscription and Clash links
ar: يدعم روابط البروكسي والاشتراك وClash
es: Compatible con enlaces de proxy, suscripción y Clash
fa: پشتیبانی از لینک‌های پروکسی، اشتراک و Clash
ru: Поддержка ссылок прокси, подписок и Clash
tr: Proxy, abonelik ve Clash bağlantılarını destekler
vi: Hỗ trợ liên kết proxy, đăng ký và Clash
zh_hans: 支持代理、订阅和 Clash 链接

source: Target
ar: الهدف
es: Destino
fa: مقصد
ru: Цель
tr: Hedef
vi: Đích
zh_hans: 目标

source: Test All
ar: اختبار الكل
es: Probar todo
fa: آزمایش همه
ru: Проверить все
tr: Tümünü Test Et
vi: Kiểm tra tất cả
zh_hans: 全部测试

source: Test Latency
ar: اختبار زمن الاستجابة
es: Probar latencia
fa: آزمایش تأخیر
ru: Проверить задержку
tr: Gecikmeyi Test Et
vi: Kiểm tra độ trễ
zh_hans: 测试延迟

source: The proxy used by the following routing rules was deleted. They have been reset to Default: %@
ar: تم حذف البروكسي المستخدم في قواعد التوجيه التالية. تمت إعادة تعيينها إلى الافتراضي: %@
es: Se eliminó el proxy utilizado por las siguientes reglas de enrutamiento. Se han restablecido a Predeterminado: %@
fa: پروکسی استفاده‌شده در قوانین مسیریابی زیر حذف شد. آن‌ها به پیش‌فرض بازنشانی شده‌اند: %@
ru: Прокси, используемый следующими правилами маршрутизации, был удалён. Они сброшены на значение по умолчанию: %@
tr: Aşağıdaki yönlendirme kurallarında kullanılan proxy silindi. Varsayılana sıfırlandılar: %@
vi: Proxy được sử dụng bởi các quy tắc định tuyến sau đã bị xóa. Chúng đã được đặt lại về Mặc định: %@
zh_hans: 以下路由规则使用的代理已被删除，它们已重置为默认: %@

source: This will skip TLS certificate validation, making your connections vulnerable to MITM attacks.
ar: سيؤدي هذا إلى تخطي التحقق من شهادة TLS، مما يجعل اتصالاتك عرضة لهجمات الوسيط.
es: Esto omitirá la validación del certificado TLS, haciendo que tus conexiones sean vulnerables a ataques MITM.
fa: این کار اعتبارسنجی گواهی TLS را رد می‌کند و اتصالات شما را در برابر حملات MITM آسیب‌پذیر می‌کند.
ru: Это пропустит проверку сертификата TLS, делая ваши соединения уязвимыми для MITM-атак.
tr: Bu, TLS sertifika doğrulamasını atlayarak bağlantılarınızı MITM saldırılarına karşı savunmasız hale getirir.
vi: Thao tác này sẽ bỏ qua xác thực chứng chỉ TLS, khiến kết nối của bạn dễ bị tấn công MITM.
zh_hans: 这将跳过 TLS 证书验证，使您的连接容易受到中间人攻击。

source: timeout
ar: انتهت المهلة
es: tiempo agotado
fa: وقفه
ru: таймаут
tr: zaman aşımı
vi: hết thời gian
zh_hans: 超时

source: TLS (Download)
ar: TLS (التنزيل)
es: TLS (descarga)
fa: TLS (دانلود)
ru: TLS (загрузка)
tr: TLS (İndirme)
vi: TLS (Tải xuống)
zh_hans: TLS（下行）

source: TLS (Upload)
ar: TLS (الرفع)
es: TLS (subida)
fa: TLS (آپلود)
ru: TLS (выгрузка)
tr: TLS (Yükleme)
vi: TLS (Tải lên)
zh_hans: TLS（上行）

source: Toggle VPN
ar: تبديل VPN
es: Alternar VPN
fa: تغییر وضعیت VPN
ru: Переключить VPN
tr: VPN'i Aç/Kapat
vi: Bật/Tắt VPN
zh_hans: VPN 开关

source: Toggle VPN connection on or off.
ar: تشغيل أو إيقاف اتصال VPN.
es: Activar o desactivar la conexión VPN.
fa: اتصال VPN را روشن یا خاموش کنید.
ru: Включить или выключить VPN-соединение.
tr: VPN bağlantısını açın veya kapatın.
vi: Bật hoặc tắt kết nối VPN.
zh_hans: 开启或关闭 VPN 连接。

source: Trademarks
ar: العلامات التجارية
es: Marcas comerciales
fa: علائم تجاری
ru: Товарные знаки
tr: Ticari Markalar
vi: Nhãn hiệu
zh_hans: 商标

source: Transparent
ar: شفاف
es: Transparente
fa: شفاف
ru: Прозрачный
tr: Şeffaf
vi: Trong suốt
zh_hans: 透明

source: Transport
ar: النقل
es: Transporte
fa: انتقال
ru: Транспорт
tr: Aktarım
vi: Truyền tải
zh_hans: 传输

source: Trusted
ar: موثوق
es: De confianza
fa: مورد اعتماد
ru: Доверен
tr: Güveniliyor
vi: Tin cậy
zh_hans: 受信任

source: Trusted Certificates
ar: الشهادات الموثوقة
es: Certificados de confianza
fa: گواهی‌های مورد اعتماد
ru: Доверенные сертификаты
tr: Güvenilir Sertifikalar
vi: Chứng chỉ tin cậy
zh_hans: 受信任的证书

source: Tunnel
ar: النفق
es: Túnel
fa: تونل
ru: Туннель
tr: Tünel
vi: Đường hầm
zh_hans: 隧道

source: Type
ar: النوع
es: Tipo
fa: نوع
ru: Тип
tr: Tür
vi: Loại
zh_hans: 类型

source: Unknown
ar: غير معروف
es: Desconocido
fa: نامشخص
ru: Неизвестно
tr: Bilinmiyor
vi: Không xác định
zh_hans: 未知

source: Unknown content.
ar: محتوى غير معروف.
es: Contenido desconocido.
fa: محتوای ناشناخته.
ru: Неизвестное содержимое.
tr: Bilinmeyen içerik.
vi: Nội dung không xác định.
zh_hans: 未知内容。

source: Update
ar: تحديث
es: Actualizar
fa: به‌روزرسانی
ru: Обновить
tr: Güncelle
vi: Cập nhật
zh_hans: 更新

source: Update Failed
ar: فشل التحديث
es: Error de actualización
fa: به‌روزرسانی ناموفق بود
ru: Ошибка обновления
tr: Güncelleme Başarısız
vi: Cập nhật thất bại
zh_hans: 更新失败

source: Upload
ar: رفع
es: Subida
fa: آپلود
ru: Выгрузка
tr: Yükle
vi: Tải lên
zh_hans: 上传

source: Upload Speed
ar: سرعة الرفع
es: Velocidad de subida
fa: سرعت آپلود
ru: Скорость выгрузки
tr: Yükleme Hızı
vi: Tốc độ tải lên
zh_hans: 上传速度

source: URL is not valid.
ar: URL غير صالح.
es: La URL no es válida.
fa: URL نامعتبر است.
ru: URL недействителен.
tr: URL geçerli değil.
vi: URL không hợp lệ.
zh_hans: URL 无效。

source: URL is required.
ar: URL مطلوب.
es: Se requiere la URL.
fa: URL الزامی است.
ru: Требуется URL.
tr: URL gereklidir.
vi: URL là bắt buộc.
zh_hans: 必须指定 URL。

source: URL Pattern
ar: نمط URL
es: Patrón de URL
fa: الگوی URL
ru: Шаблон URL
tr: URL Deseni
vi: Mẫu URL
zh_hans: URL 模式

source: URL Pattern is not a valid regular expression.
ar: نمط URL ليس تعبيرًا منتظمًا صالحًا.
es: El patrón de URL no es una expresión regular válida.
fa: الگوی URL یک عبارت منظم معتبر نیست.
ru: Шаблон URL не является допустимым регулярным выражением.
tr: URL deseni geçerli bir düzenli ifade değildir.
vi: Mẫu URL không phải là biểu thức chính quy hợp lệ.
zh_hans: URL 模式不是一个有效的正则表达式。

source: URL Pattern is required.
ar: نمط URL مطلوب.
es: Se requiere el patrón de URL.
fa: الگوی URL الزامی است.
ru: Требуется шаблон URL.
tr: URL deseni gereklidir.
vi: Mẫu URL là bắt buộc.
zh_hans: 必须指定 URL 模式。

source: Username
ar: اسم المستخدم
es: Nombre de usuario
fa: نام کاربری
ru: Имя пользователя
tr: Kullanıcı Adı
vi: Tên người dùng
zh_hans: 用户名

source: Utilities
ar: الأدوات المساعدة
es: Utilidades
fa: ابزارها
ru: Утилиты
tr: Araçlar
vi: Tiện ích
zh_hans: 工具

source: VPN Enabled
ar: VPN مفعّل
es: VPN activado
fa: VPN فعال
ru: VPN включён
tr: VPN etkin
vi: VPN đã bật
zh_hans: VPN 已启用

source: VPN Error
ar: خطأ VPN
es: Error de VPN
fa: خطای VPN
ru: Ошибка VPN
tr: VPN Hatası
vi: Lỗi VPN
zh_hans: VPN 错误

source: You
ar: أنت
es: Tú
fa: شما
ru: Вы
tr: Siz
vi: Bạn
zh_hans: 你

source: You'll need to regenerate a certificate to use MITM again.
ar: ستحتاج إلى إعادة إنشاء شهادة لاستخدام MITM مرة أخرى.
es: Necesitarás regenerar un certificado para volver a usar MITM.
fa: برای استفاده مجدد از MITM، باید گواهی را دوباره تولید کنید.
ru: Вам потребуется создать сертификат заново, чтобы снова использовать MITM.
tr: MITM'i tekrar kullanmak için bir sertifikayı yeniden oluşturmanız gerekecek.
vi: Bạn sẽ cần tạo lại chứng chỉ để sử dụng MITM một lần nữa.
zh_hans: 你将需要重新生成证书以再次使用 MITM。
